# 1. Написати sql запит, який вибере усі записи із таблиці users старше
# 30 років.
# 2. Написати sql запит, який виведе кількість записів в табліці users, що старше 30 років.
# 3. Написати sql запит, який виведе інформацію про вік (кількість років) та кількість
# користувачів, які відповідають цьому віку. Результатом виконання такого запиту має
# бути таблиця:

    # age  | users
    # 32    | 1
    # 52    | 2
    # 120  | 2
    # 1142 | 1

# 4. Написати sql запит, який буде робити те саме, що і в завданні 3, але виводити дані
# відсортовані по кількості користувачів у спадаючому порядку та по віку у зростаючому
# порядку. Результатом має бути таблиця:
    # age  | users
    # 52    | 2
    # 120  | 2
    # 32    | 1
    # 1142 | 1