# 1. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи генератори.
# Приклад: при введені 3 виведе 2, при введенні 6 виведе 8, при введенні 9 виведе 34.


# функція чисел фібоначчі
def fibonacci(n):
    n1, n2 = 0, 1
    for __ in range(n):
        yield n1
        n1, n2 = n2, n1 + n2

while True:
    n = int(input("Type index of Fibonacci number: "))
    gen = list(fibonacci(n+1)) # генератор
    print(gen[n])
    


# 2. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи ітератори (необов'язкове виконання).
# 3. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи рекурсію (необов'язкове виконання).
# 4. Написати програму, яка буде повертати факторіал введеного числа, використовуючи рекурсію (необов'язкове виконання).
# coming soon