# 1. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи генератори.
# 2. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи ітератори (необов'язкове виконання).
# 3. Створити програму, яка буде приймати число і друкувати відповідне число в послідовності Фібоначчі, використовуючи рекурсію (необов'язкове виконання).
# 4. Написати програму, яка буде повертати факторіал введеного числа, використовуючи рекурсію (необов'язкове виконання).
# Що таке число Фібоначчі читайте за посиланням.
# Приклад: при введені 3 виведе 2, при введенні 6 виведе 8, при введенні 9 виведе 34.